# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [4,5,  8,10,  13,16]  # P3/8
  - [23,29,  43,55,  73,105]  # P4/16
  - [146,217,  231,300,  335,433]  # P5/32

# YOLOv5 v6.0 backbone
backbone:                                       #channel * (1/width_multiple)
  # [from, number, module, args]                input size [N, 3, 640, 640]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2                 [N, 16, 320, 320]
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4                   [N, 32, 160, 160]
   [-1, 3, C3, [128]], #                                   [N, 32, 160, 160]
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8                   [N, 64, 80, 80]
   [-1, 6, C3, [256]], #                                   [N, 64, 80, 80]
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16                  [N, 128, 40, 40]
   [-1, 9, C3, [512]], #                                   [N, 128, 40, 40]
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32                 [N, 256, 20, 20]
   [-1, 1, SPPF, [1024, 5]],  # 9                          [N, 256, 20, 20]
   [-1, 3, C3, [1024, False]],#                                   [N, 256, 20, 20]
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #                           [N, 128, 20, 20]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #           [N, 128, 40, 40]
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4           [N, 256, 40, 40]
   [-1, 3, C3, [512, False]],  # 13                        [N, 128, 40, 40]

   [-1, 1, Conv, [256, 1, 1]], #                           [N, 64, 40, 40]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #           [N, 64, 80, 80]
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3           [N, 128, 80, 80]
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)           [N, 64, 80, 80]

   [-1, 1, Conv, [256, 3, 2]], #                           [N, 64, 40, 40]
   [[-1, 14], 1, Concat, [1]],  # cat head P4              [N, 128, 40, 40]
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)         [N, 128, 40, 40]

   [-1, 1, Conv, [512, 3, 2]], #                           [N, 128, 20, 20]
   [[-1, 10], 1, Concat, [1]],  # cat head P5              [N, 256, 20, 20]
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)         [N, 256, 20, 20]

   [[17, 20, 23], 1, LmkDetect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

#YOLOv5n summary: 270 layers, 1872157 parameters, 1872157 gradients, 4.5 GFLOPs